In [1]:
import pandas as pd

In [2]:
a='l1 l2 l3 l4'.split()
a

['l1', 'l2', 'l3', 'l4']

In [7]:
data=[(1,2,3,4),(5,6,7,8),(9,10,11,12),(13,14,15,16)]
df = pd.DataFrame(data,a,'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [10]:
df[['c1','c3']]

    c1  c3
l1   1   3
l2   5   7
l3   9  11
l4  13  15

In [16]:
df[::-1]

    c1  c2  c3  c4
l4  13  14  15  16
l3   9  10  11  12
l2   5   6   7   8
l1   1   2   3   4

In [18]:
df[1:2][['c3','c1']]

    c3  c1
l2   7   5

In [19]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [20]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [21]:
df.loc[['l2','l3']]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [22]:
df.loc['l1','c2']

2

In [28]:
df.iloc[1,1]

6

In [29]:
df.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   9
l1   4   1

In [36]:
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   9
l1   4   1